---
kind: type
id: T:Autodesk.Revit.DB.DocumentType
source: html/f980a45e-61f3-de6e-9af3-9277d5537b4b.htm
---
# Autodesk.Revit.DB.DocumentType

Types of Revit documents.

## Syntax (C#)
```csharp
public enum DocumentType
```